<a href="https://colab.research.google.com/github/DianaMutekhele/DATABASES/blob/main/Copy_of_Introduction_to_SQL_Aug_2021.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### **Introduction to SQL Database Commands**

In [ ]:
# installing the sqlite database

!pip install db-sqlite3

Collecting db-sqlite3
  Downloading db-sqlite3-0.0.1.tar.gz (1.4 kB)
Collecting db
  Downloading db-0.1.1.tar.gz (3.4 kB)
Collecting antiorm
  Downloading antiorm-1.2.1.tar.gz (171 kB)
     |████████████████████████████████| 171 kB 8.4 MB/s
Building wheels for collected packages: db-sqlite3, db, antiorm
  Building wheel for db-sqlite3 (setup.py) ... done
  Created wheel for db-sqlite3: filename=db_sqlite3-0.0.1-py3-none-any.whl size=1795 sha256=e20f9f0eb33119ef779217628f601ae1218f1c60f1e77e2ce73942ca4c47e8c1
  Stored in directory: /root/.cache/pip/wheels/02/38/d5/2f54461050571bf5330fee2a37ab1c9b5e7540b0572f1acdab
  Building wheel for db (setup.py) ... done
  Created wheel for db: filename=db-0.1.1-py3-none-any.whl size=3894 sha256=a70e5c476fcca4eac89bbc5042d13ccc4692a840168fffe93b18130c9642ee1b
  Stored in directory: /root/.cache/pip/wheels/8e/97/82/741d2b360507411ec233d0280d7371faa94b03bde834e4a9be
  Building wheel for antiorm (setup.py) ... done
  Created wheel for antiorm: filename=antiorm-1.2.1-py3-none-any.whl size=31678 sha256=c1a956b5bd1f5f30c4c1c1f4033873c7701d4023d6048b7c83dac323d5dedb6e
  Stored in directory: /root/.cache/pip/wheels/c5/43/70/e9729370cfff40c49d3e3d05377d54b3ecd71f64e62341ea80
Successfully built db-sqlite3 db antiorm
Installing collected packages: antiorm, db, db-sqlite3
Successfully installed antiorm-1.2.1 db-0.1.1 db-sqlite3-0.0.1

In [ ]:
# import the required libraries sqlite, pandas, and date time
import sqlite3
import pandas as pd
from datetime import date

In [ ]:
#connect with test db

db =sqlite3.connect("test.db")

# drop the table results if it exist
db.execute("DROP TABLE IF EXISTS results")
# Define database schema
try:
  db.execute("create table results (Name text, Country text,Date datetime,Phone text, Email text)")
except:
  print("table already exist")

In [ ]:
# connect again
db =sqlite3.connect("test.db")

In [ ]:
# Create data

Name ="Maybin Katongo"
Country = "Zambia"
Date =date.today().strftime("%d-%m-%Y")
Phone ="+26072665545"
Email ="maybinkatongo@gmail.com"

In [ ]:
cmd = "insert into results(Name,Country, Phone,Date,Email) values('{}','{}','{}','{}','{}')".format(Name,Country,Phone,Date,Email)
db.execute(cmd)
db.commit()

**Querying**

In [ ]:
# Querying the data in the database using SQL

db = sqlite3.connect("test.db")
rs = db.execute('SELECT * FROM results')
for row in rs:
    print (row)

('Maybin Katongo', 'Zambia', '26-08-2021', '+26072665545', 'maybinkatongo@gmail.com')

Add Another Record

In [ ]:
# Create data

Name ="Diana Mutekhele"
Country = "Kenya"
Date =date.today().strftime("%d-%m-%Y")
Phone ="+25472665545"
Email ="dianamutekhele@gmail.com"


cmd = "insert into results(Name,Country, Phone,Date,Email) values('{}','{}','{}','{}','{}')".format(Name,Country,Phone,Date,Email)
db.execute(cmd)
db.commit()

In [ ]:
# Create data

Name ="David Agbi"
Country = "Nigeria"
Date =date.today().strftime("%d-%m-%Y")
Phone ="+23472665545"
Email ="davidagbi@gmail.com"


cmd = "insert into results(Name,Country, Phone,Date,Email) values('{}','{}','{}','{}','{}')".format(Name,Country,Phone,Date,Email)
db.execute(cmd)
db.commit()

In [ ]:
cmd = 'UPDATE results  SET "Country" = "Uganda" WHERE "Country" ="Kenya" '
db.execute(cmd)
db.commit()

In [ ]:
# Querying the data in the database using SQL

db = sqlite3.connect("test.db")
rs = db.execute('SELECT * FROM results WHERE "Country" = "Uganda"')
for row in rs:
    print (row)

('Diana Mutekhele', 'Uganda', '26-08-2021', '+25472665545', 'dianamutekhele@gmail.com')

In [ ]:
# reading the dataset into pandas for more downstream operations

db = sqlite3.connect("test.db")
qry = """

SELECT * FROM results 

"""
df = pd.read_sql_query(qry, db)

df.head()

              Name  Country        Date         Phone                     Email
0   Maybin Katongo   Zambia  26-08-2021  +26072665545   maybinkatongo@gmail.com
1  Diana Mutekhele   Uganda  26-08-2021  +25472665545  dianamutekhele@gmail.com
2       David Agbi  Nigeria  26-08-2021  +23472665545       davidagbi@gmail.com

In [ ]:
df = pd.read_sql_query('SELECT * FROM results WHERE "Country" LIKE "U%"', db)
df

              Name Country        Date         Phone                     Email
0  Diana Mutekhele  Uganda  26-08-2021  +25472665545  dianamutekhele@gmail.com

## Use pandas to write table into a database

In [ ]:
california_housing_test = pd.read_csv('sample_data/california_housing_test.csv')
california_housing_test.shape

(3000, 9)

In [ ]:
california_housing_test.head(7)

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0
5    -119.56     36.51  ...         1.6635             67000.0
6    -121.43     38.63  ...         1.6641             67000.0

[7 rows x 9 columns]

In [ ]:
california_housing_test.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [ ]:
db.execute("DROP TABLE IF EXISTS california_housing_test")

In [ ]:
#Write the california_housing_test data frame into the database using pandas function to_sql
california_housing_test.to_sql('california_housing_test', con=db, if_exists='replace', index = False)

Read the database table into Python using *pd.read_sql_query* function

In [ ]:
california_housing_test_1 = pd.read_sql_query(
    'SELECT * FROM california_housing_test WHERE (housing_median_age >30 AND total_rooms >1500)',
     db)
print(california_housing_test_1.shape)
california_housing_test_1.head(4)

(851, 9)

   longitude  latitude  ...  median_income  median_house_value
0    -118.30     34.26  ...         3.5990            176500.0
1    -118.02     34.08  ...         2.3333            164200.0
2    -122.59     38.01  ...         6.1724            414300.0
3    -121.37     38.68  ...         3.1786             83400.0

[4 rows x 9 columns]

Select data from a database table on condition using WHERE command

In [ ]:
california_median_age_greater_than_30 = pd.read_sql_query('SELECT * FROM california_housing_test WHERE housing_median_age > 30', db)
california_median_age_greater_than_30.head(12)

    longitude  latitude  ...  median_income  median_house_value
0     -118.30     34.26  ...         3.5990            176500.0
1     -119.56     36.51  ...         1.6635             67000.0
2     -121.43     38.63  ...         1.6641             67000.0
3     -118.02     34.08  ...         2.3333            164200.0
4     -118.24     33.98  ...         2.2054            125000.0
5     -119.12     35.85  ...         2.4167             58300.0
6     -121.93     37.25  ...         4.6900            252600.0
7     -117.99     33.81  ...         2.2000            153100.0
8     -122.59     38.01  ...         6.1724            414300.0
9     -122.15     37.75  ...         3.8913            126300.0
10    -121.37     38.68  ...         3.1786             83400.0
11    -118.16     34.07  ...         3.8644            241500.0

[12 rows x 9 columns]